In [1]:
import pandas as pd
import seaborn as sns

## Ethiopia Production

In [2]:
prod_df = pd.read_csv('./data/production.csv')

In [3]:
prod_df.shape

(56, 32)

In [4]:
prod_df = prod_df.T

In [5]:
e_prod = pd.DataFrame(prod_df)

In [6]:
header = e_prod.iloc[0]
e_prod = e_prod[1:]
e_prod.columns = header

In [7]:
#setting column name as the country names
e_prod.columns = e_prod.iloc[0]

In [8]:
# dropping first row
e_prod = e_prod.iloc[1:]

In [9]:
e_prod = e_prod[['Ethiopia']]

In [10]:
e_prod['year'] = e_prod.index

In [11]:
e_prod.columns = [col.lower().strip().replace(' ', '_')
    for col in e_prod.columns]

In [12]:
e_prod = e_prod.rename(columns = {'ethiopia':'e_prod'})

In [13]:
e_prod.head()

           e_prod     year
1990/91  2909.451  1990/91
1991/92  2924.664  1991/92
1992/93  1825.171  1992/93
1993/94  2967.004  1993/94
1994/95   2762.73  1994/95

In [18]:
e_prod['year'] = e_prod['year'].apply(
    lambda x:(x.split('/')[0]))

In [19]:
e_prod['year'] = e_prod['year'].astype(float)

In [20]:
e_prod['e_prod'] = e_prod['e_prod'].astype(float)

## Retail Prices

In [21]:
retail_prices = pd.read_excel('./data/3b - retail_prices.xlsx')

In [22]:
retail_prices.head()

,Year,Austria,Belgium,Bulgaria,Cyprus,Czechia,Denmark,Finland,France,Germany,...,Slovakia,Slovenia,Spain,Sweden,Japan,Norway,Russian Federation,Switzerland,United Kingdom 1,United States of America
0,1990,4.90,3.27,NaN,2.83,NaN,3.81,2.98,3.73,3.99,...,NaN,NaN,3.62,3.43,10.26,3.31,NaN,4.83,10.55,2.97
1,1991,4.57,2.92,NaN,2.80,NaN,3.67,2.72,3.43,3.84,...,NaN,NaN,3.50,3.29,11.88,3.16,NaN,4.36,10.41,2.81
2,1992,4.99,3.05,NaN,2.87,NaN,3.79,2.46,2.31,4.00,...,NaN,NaN,3.50,3.11,12.62,3.12,NaN,4.52,10.09,2.58
3,1993,4.97,2.78,NaN,2.60,NaN,3.48,1.94,2.03,3.62,...,NaN,NaN,2.79,2.65,14.57,2.46,NaN,4.27,8.44,2.47
4,1994,4.58,3.42,NaN,3.18,NaN,4.45,2.73,2.40,4.18,...,NaN,NaN,2.76,3.79,14.69,3.29,NaN,4.50,11.36,3.40

## Ethiopia Temp

In [23]:
temp_df = pd.read_csv('data/Ethiopia/FAOSTAT_data_1-10-2022.csv')

In [24]:
ethiopia_temp_change = temp_df[temp_df.Area == 'Ethiopia']

In [25]:
ethiopia_temp_change.columns = [col.lower().strip().replace(' ', '_')
    for col in ethiopia_temp_change.columns]

In [26]:
ethiopia_temp_change = ethiopia_temp_change[ethiopia_temp_change['months']=='Meteorological year'].sort_values(by=['months', 'year'], ascending= False)

In [27]:
e_temp_change = ethiopia_temp_change[['year','value']].iloc[::-1]

In [28]:
e_temp_change.rename(columns={'value':'e_temp_change'}, inplace = True)

In [29]:
e_temp_change.head()

       year  e_temp_change
70182  1993          0.244
70183  1994          0.599
70184  1995          0.815
70185  1996          0.775
70186  1997          0.713

In [30]:
e_temp_change['year'] = e_temp_change['year'].astype(float)

## Ethiopia Exports

In [31]:
e_export = pd.read_excel('./data/2a - Exports - calendar year.xlsx')

In [32]:
e_export.dropna(inplace = True)

In [33]:
e_export = e_export.T

In [34]:
new_header = e_export.iloc[0]
e_export = e_export[1:] 
e_export.columns = new_header

In [35]:
e_export.columns = [col.lower().strip().replace(' ','_') 
                         for col in e_export.columns]

In [36]:
e_export = e_export[['calendar_years','ethiopia']]

In [37]:
e_export.rename(columns={'calendar_years':'year', 'ethiopia':'e_export'}, inplace = True)

In [38]:
e_export['year'] = e_export['year'].apply(
    lambda x:(str(x).split('.')[0]))

In [39]:
e_export.head()

            year  e_export
Unnamed: 1  1990  1074.101
Unnamed: 2  1991   841.329
Unnamed: 3  1992   734.461
Unnamed: 4  1993  1166.778
Unnamed: 5  1994  1475.325

In [40]:
e_export['year'] = e_export['year'].astype(float)

In [41]:
e_export['e_export'] = e_export['e_export'].astype(float)

## Ethiopia Domestic Consumption (Disappearance)

In [42]:
e_consumption = pd.read_excel('./data/1b - Domestic consumption.xlsx')

/Users/sangs/opt/anaconda3/lib/python3.9/site-packages/openpyxl/worksheet/_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [43]:
e_consumption = e_consumption.T

In [44]:
new_header = e_consumption.iloc[0]
e_consumption = e_consumption[1:] 
e_consumption.columns = new_header

In [45]:
e_consumption = e_consumption.drop(e_consumption.index[:1])

In [46]:
e_consumption = e_consumption.drop(e_consumption.columns[:2], axis = 1)

In [47]:
e_consumption = e_consumption[['Crop year','Ethiopia']]

In [48]:
e_consumption.columns = [col.lower().strip().replace(' ','_') 
                         for col in e_consumption.columns]

In [49]:
e_consumption.rename(columns = {'crop_year':'year',
                                'ethiopia':'e_consumption'},
                     inplace = True)

In [50]:
e_consumption['year'] = e_export['year'].apply(
    lambda x:(str(x).split('/')[0]))

In [51]:
e_consumption.head()

              year e_consumption
Unnamed: 2  1991.0          1200
Unnamed: 3  1992.0          1264
Unnamed: 4  1993.0          1331
Unnamed: 5  1994.0          1402
Unnamed: 6  1995.0          1476

In [52]:
e_consumption.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30 entries, Unnamed: 2 to Unnamed: 31
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   year           29 non-null     object
 1   e_consumption  30 non-null     object
dtypes: object(2)
memory usage: 720.0+ bytes

In [53]:
e_consumption['year'] = e_consumption['year'].astype(float)

In [54]:
e_consumption['e_consumption'] = e_consumption['e_consumption'].astype(float)

### Ethiopia Avg Temperature

In [55]:
e_avg_temp = pd.read_csv('./data/Ethiopia/Ethiopia_mean_temp.csv', header = 1 )

In [56]:
e_avg_temp.rename(columns={'Unnamed: 0':'year'}, inplace = True)

In [57]:
e_avg_temp = e_avg_temp[['year', 'Ethiopia']]

In [71]:
e_avg_temp.rename(columns={'Ethiopia':'e_avg_temp'}, inplace = True)

In [72]:
e_avg_temp.head()

     year  e_avg_temp
0  1901.0       22.95
1  1902.0       22.88
2  1903.0       22.95
3  1904.0       22.71
4  1905.0       22.81

In [73]:
e_avg_temp['year'] = e_avg_temp['year'].astype(float)

In [74]:
e_avg_temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 121 entries, 0 to 120
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        121 non-null    float64
 1   e_avg_temp  121 non-null    float64
dtypes: float64(2)
memory usage: 2.0 KB

## Merge dataframes

e_prod
e_temp_change
e_export
e_consumption

In [75]:
prod_temp_df = pd.merge(e_prod, e_temp_change, how='outer', on='year')

In [76]:
export_consump = pd.merge(e_export, e_consumption, how='outer', on='year')

In [77]:
ethiopia_df = pd.merge(prod_temp_df, export_consump, how='outer', on='year')

In [78]:
ethiopia_df = pd.merge(ethiopia_df, e_avg_temp, how='outer', on='year')

In [79]:
ethiopia_df

       e_prod    year  e_temp_change  e_export  e_consumption  e_avg_temp
0    2909.451  1990.0            NaN  1074.101            NaN       23.04
1    2924.664  1991.0            NaN   841.329         1200.0       23.13
2    1825.171  1992.0            NaN   734.461         1264.0       22.79
3    2967.004  1993.0          0.244  1166.778         1331.0       22.82
4    2762.730  1994.0          0.599  1475.325         1402.0       22.91
..        ...     ...            ...       ...            ...         ...
117       NaN  1986.0            NaN       NaN            NaN       22.95
118       NaN  1987.0            NaN       NaN            NaN       23.15
119       NaN  1988.0            NaN       NaN            NaN       22.97
120       NaN  1989.0            NaN       NaN            NaN       22.45
121       NaN  2021.0            NaN       NaN            NaN       23.35

[122 rows x 6 columns]

In [82]:
ethiopia_df = ethiopia_df[['year','e_prod','e_export','e_consumption','e_temp_change', 'e_avg_temp']]

In [83]:
ethiopia_df

       year    e_prod  e_export  e_consumption  e_temp_change  e_avg_temp
0    1990.0  2909.451  1074.101            NaN            NaN       23.04
1    1991.0  2924.664   841.329         1200.0            NaN       23.13
2    1992.0  1825.171   734.461         1264.0            NaN       22.79
3    1993.0  2967.004  1166.778         1331.0          0.244       22.82
4    1994.0  2762.730  1475.325         1402.0          0.599       22.91
..      ...       ...       ...            ...            ...         ...
117  1986.0       NaN       NaN            NaN            NaN       22.95
118  1987.0       NaN       NaN            NaN            NaN       23.15
119  1988.0       NaN       NaN            NaN            NaN       22.97
120  1989.0       NaN       NaN            NaN            NaN       22.45
121  2021.0       NaN       NaN            NaN            NaN       23.35

[122 rows x 6 columns]

In [84]:
ethiopia_df.to_csv('./data/Ethiopia/ethiopia_df.csv')